perf.txt
wrk -t12 -c400 -d30s http://127.0.0.1:8000/
Running 30s test @ http://127.0.0.1:8000/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45s   636.06ms   2.00s    77.66%
    Req/Sec    42.20     35.64   181.00     62.79%
  5598 requests in 30.06s, 103.64MB read
  Socket errors: connect 0, read 5598, write 0, timeout 4864
Requests/sec:    186.23
Transfer/sec:      3.45MB